{
    "Login": "دخول",
    "Register": "تسجيل",
    "Logout": "خروج",
    "E-Mail Address" : "عنوان البريد الإلكتروني",
    "Email" : "البريد الإلكتروني",
    "Password"       : "كلمة المرور",
    "Remember me"     :  " تذكر بيانات الدخول",
    "Forgot your password?"  : "هل نسيت كلمة المرور؟",
    "Already registered?"  : "مسجل مسبقًا؟",
    "Name"            : "اسم المستخدم",
    "Confirm Password" : "تأكيد كلمة المرور",
    "Reset Password" : "إعادة تعيين كلمة المرور",
    "Email Password Reset Link" : "أرسل رابط استعادة كلمة المرور",
    "Verify Your Email Address" : "التحقق من البريد الإلكتروني",
    "link has been sent" : "تم إرسال رابط التحقق إلى عنوان بريدك الإلكتروني.",
    "Before proceeding" : "قبل المتابعة، يرجى التحقق من بريدك الالكتروني للحصول على رابط التحقق. ",
    "If you did not receive" : "إذا لم تستلم البريد الإلكتروني",
    "click here" : "فانقر هنا لإعادة الطلب",  
    "Owner"           : "صاحب عمل",
    "User"           : "مستخدم عادي",
    "Dashboard" : "لوحة التحكم",
    "Manage Account" : "إدارة الحساب",
    "Profile" : "الصفحة الشخصية",
    "Save" : "حفظ",
    "Saved.": "تم الحفظ",
    "Profile Information": "معلومات الملف الشخصي",
    "Update your account's profile information and email address." :"قم بتحديث معلومات ملف تعريف حسابك وعنوان البريد الإلكتروني.",
    "Photo": "الصورة",
    "Select A New Photo": "اختر صورة جديدة",
    "Remove Photo": "حذف صورة",
    "Update Password": "",
    "Ensure your account is using a long, random password to stay secure.": "تأكد من أن حسابك يستخدم كلمة مرور طويلة وعشوائية للبقاء آمنًا.",
    "Current Password": "كلمة المرور الحالية",
    "New Password": "كلمة المرور الجديدة",
    "Two Factor Authentication": "المصادقة الثنائية",
    "Add additional security to your account using two factor authentication.": "أضف أمانًا إضافيًا إلى حسابك باستخدام المصادقة الثنائية.",
    "You have not enabled two factor authentication.":"لم تقم بتمكين المصادقة الثنائية.",
    "When two factor authentication is enabled, you will be prompted for a secure, random token during authentication. You may retrieve this token from your phone's Google Authenticator application." : "عند تمكين المصادقة الثنائية ، ستتم مطالبتك برمز آمن وعشوائي أثناء المصادقة. يمكنك استرداد هذا الرمز المميز من تطبيق Google Authenticator بهاتفك.",
    "Browser Sessions": "جلسات التصفح",
    "Enable": "تفعيل",
    "Logout Other Browser Sessions": "تسجيل الخروج جلسات المتصفح الأخرى",
    "Manage and logout your active sessions on other browsers and devices.": "إدارة جلساتك النشطة وتسجيل الخروج منها على المتصفحات والأجهزة الأخرى.",
    "If necessary, you may logout of all of your other browser sessions across all of your devices. Some of your recent sessions are listed below; however, this list may not be exhaustive. If you feel your account has been compromised, you should also update your password.": "إذا لزم الأمر ، يمكنك تسجيل الخروج من جميع جلسات المتصفح الأخرى من جميع أجهزتك. بعض جلساتك الأخيرة مذكورة أدناه ؛ ومع ذلك ، قد لا تكون هذه القائمة شاملة. إذا شعرت أنه تم اختراق حسابك ، فيجب عليك أيضًا تحديث كلمة المرور الخاصة بك.",
    "Delete Account": "حذف الحساب",
    "Permanently delete your account.": "حذف الحساب بشكل دائم",
    "Once your account is deleted, all of its resources and data will be permanently deleted. Before deleting your account, please download any data or information that you wish to retain.": "بمجرد حذف حسابك ، سيتم حذف جميع موارده وبياناته نهائيًا. قبل حذف حسابك ، يرجى تنزيل أي بيانات أو معلومات ترغب في الاحتفاظ بها.",
    "Forgot your password? No problem. Just let us know your email address and we will email you a password reset link that will allow you to choose a new one." : "هل نسيت كلمة المرور؟ ليس هناك أى مشكلة. فقط زودنا بعنوان بريدك الإلكتروني وسنرسل لك عبر البريد الإلكتروني رابط إعادة تعيين كلمة المرور الذي سيسمح لك بتعيين مفتاح جديد."
}